### Data

In [12]:
# DATA PERTAMA
import pandas as pd
nama = ['Berti','Ryndes','Arin']
tugas = [95,90,75]
jurusan = ['IF','SI','KA']
df3 = pd.DataFrame({'Nama':nama, 'Tugas':tugas, 'Jurusan':jurusan}, index=['L1','L2','L3'])
df3

      Nama  Tugas Jurusan
L1   Berti     95      IF
L2  Ryndes     90      SI
L3    Arin     75      KA

In [13]:
# DATA KEDUA
import pandas as pd
nama = ['Berti','Ryndes','Rylo']
uts = [85,84,70]
jurusan = ['IF','SI','SI']
df4 = pd.DataFrame({'Nama B':nama, 'UTS':uts, 'Jurusan B':jurusan}, index=['L2','L3','L4'])
df4

    Nama B  UTS Jurusan B
L2   Berti   85        IF
L3  Ryndes   84        SI
L4    Rylo   70        SI

Inner Join

In [14]:
# INNER JOIN
df3.join(df4, how='inner')

      Nama  Tugas Jurusan  Nama B  UTS Jurusan B
L2  Ryndes     90      SI   Berti   85        IF
L3    Arin     75      KA  Ryndes   84        SI

Left Join

In [15]:
# LEFT JOIN
df3.join(df4, how='left')

      Nama  Tugas Jurusan  Nama B   UTS Jurusan B
L1   Berti     95      IF     NaN   NaN       NaN
L2  Ryndes     90      SI   Berti  85.0        IF
L3    Arin     75      KA  Ryndes  84.0        SI

Right Join

In [16]:
# RIGHT JOIN
df3.join(df4, how='right')

      Nama  Tugas Jurusan  Nama B  UTS Jurusan B
L2  Ryndes   90.0      SI   Berti   85        IF
L3    Arin   75.0      KA  Ryndes   84        SI
L4     NaN    NaN     NaN    Rylo   70        SI

Outer Join

In [17]:
# OUTER JOIN
df3.join(df4, how='outer')

      Nama  Tugas Jurusan  Nama B   UTS Jurusan B
L1   Berti   95.0      IF     NaN   NaN       NaN
L2  Ryndes   90.0      SI   Berti  85.0        IF
L3    Arin   75.0      KA  Ryndes  84.0        SI
L4     NaN    NaN     NaN    Rylo  70.0        SI

Concatenate

In [18]:
pd.concat([df3,df4], sort='False')

C:\Users\Administrator\AppData\Local\Temp\ipykernel_2888\2183828127.py:1: FutureWarning: Passing non boolean values for sort is deprecated and will error in a future version!
  pd.concat([df3,df4], sort='False')

   Jurusan Jurusan B    Nama  Nama B  Tugas   UTS
L1      IF       NaN   Berti     NaN   95.0   NaN
L2      SI       NaN  Ryndes     NaN   90.0   NaN
L3      KA       NaN    Arin     NaN   75.0   NaN
L2     NaN        IF     NaN   Berti    NaN  85.0
L3     NaN        SI     NaN  Ryndes    NaN  84.0
L4     NaN        SI     NaN    Rylo    NaN  70.0